<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 138.0.3351.95--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Latausohjelman ohitusasetukset</string><string id="BrowserExecutableFolder">Määritä selaimen suoritettavan kansion sijainti</string><string id="BrowserExecutableFolder_Explain">Tämä käytäntö määrittää WebView2-sovellukset käyttämään WebView2 Runtimea määritetyllä polulla. Kansion tulee sisältää seuraavat tiedostot: msedgewebview2, msedge.dll ja niin edelleen.

Määritä kansiopolun arvo kirjoittamalla arvonimi ja arvopari. Määritä arvon nimi sovelluksen käyttäjämallin tunnukseen tai ohjelmatiedoston nimeen. Voit käyttää yleismerkkiä * kaikkiin sovelluksiin lisättävän arvon nimenä.

Esimerkkiarvo:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Määritä selaimen suoritettavan kansion sijainti</string><string id="ChannelSearchKind">Määritä WebView2-julkaisukanavan hakutyyppi</string><string id="ChannelSearchKind_Explain">Tämä käytäntö määrittää WebView2-sovellusten kanavahakutyypin. Oletusarvoisesti kanavahakutyyppi on 0, joka vastaa vastaavan WebView2-ohjelmointirajapinnan vakainta mahdollista hakutyyppiä. Tämä tarkoittaa sitä, että WebView2-ympäristön luomisen tulee hakea julkaisukanavaa vakaimmasta vähiten vakaaseen: WebView2 Runtime, Beta, Dev ja Canary.

Jos haluat muuttaa oletushakujärjestyksen käänteiseksi ja käyttää vähiten vakaata hakutyyppiä, määritä tämän käytännön arvoksi 1.

Jos haluat määrittää kanavan hakutyypin arvon, anna arvonimi ja arvopari. Määritä arvon nimeksi sovelluksen käyttäjämallin tunnus tai suoritettavan tiedoston nimi. Voit käyttää yleismerkkiä * kaikissa sovelluksissa käytettävien arvojen nimissä.

Esimerkkiarvo:

Name: WebView2APISample.exe, Value: 1</string><string id="ChannelSearchKindDesc">Määritä WebView2-julkaisukanavan hakutyyppi</string><string id="ReleaseChannelPreference">Määritä julkaisukanavan hakujärjestyksen asetukset (vanhentunut)</string><string id="ReleaseChannelPreference_Explain">VANHENTUNUT: Tämä käytäntöasetus on vanhentunut. Se on tällä hetkellä tuettu, mutta se vanhentuu tulevassa versiossa.

Tämä käytäntö on vanhentunut ja korvattu ChannelSearchKind-käytännöllä hyväksi, jolla on samat toiminnot. Tämä käytäntö poistetaan kokonaan käytöstä 124-julkaisussa. Kanavan oletusarvoinen hakujärjestys on WebView2 Runtime, Beta, Dev ja Canary.

Voit kääntää oletusarvoisen hakujärjestyksen muuttamalla tämän käytännön arvoksi 1.

Määritä haluamasi julkaisukanava-asetuksen arvo antamalla arvon nimi ja arvopari. Määritä arvon nimeksi sovelluksen käyttäjämallin tunnus tai suoritettavan tiedoston nimi. Voit käyttää yleismerkkiä * kaikissa sovelluksissa käytettävien arvojen nimissä.

Esimerkkiarvo:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Määritä julkaisukanavan hakujärjestyksen asetukset (vanhentunut)</string><string id="ReleaseChannels">Määritä WebView2-julkaisukanavat</string><string id="ReleaseChannels_Explain">Tämä käytäntö määrittää WebView2-sovellusten julkaisukanava-asetukset. Jos haluat määrittää nämä asetukset, aseta arvoksi pilkuin eroteltu kokonaislukujen merkkijono, joka yhdistetään vastaavan WebView2-ohjelmointirajapinnan COREWEBVIEW2_RELEASE_CHANNELS-arvoihin. Nämä arvot ovat seuraavat: WebView2 Runtime (0), Beta (1), Dev (2) ja Canary (3). Oletusarvoisesti ympäristön luonti etsii kanavia vakaimmasta vähiten vakaaseen ja käyttää ensimmäistä laitteesta löytynyttä kanavaa. Kun ReleaseChannels on annettu, ympäristön luonti etsii vain joukossa määritettyjä kanavia. Esimerkiksi arvot 0,2 ja 2,0 tarkoittavat sitä, että ympäristön luonnin tulee hakea vain Dev-kanavaa ja WebView2-suorituspalvelua channelSearchKind-kohteen ilmaisemassa järjestyksessä. Ympäristön luonti yrittää tulkita kunkin kokonaisluvun ja käsittelee mitä tahansa virheellistä merkintää vakaana kanavana. Määritä ChannelSearchKind, jos haluat muuttaa hakujärjestyksen käänteiseksi, jotta ympäristön luonti etsii ensin vähiten vakaata koontiversiota. Jos sekä BrowserExecutableFolder että ReleaseChannels annetaan, BrowserExecutableFolder on ensisijainen riippumatta siitä, sisältyykö BrowserExecutableFolder-kanava ReleaseChannels-kanavaan.

Määritä haluamasi julkaisukanavat antamalla arvon nimi ja arvopari. Määritä arvon nimeksi sovelluksen käyttäjämallin tunnus tai suoritettavan tiedoston nimi. Voit käyttää yleismerkkiä * kaikissa sovelluksissa käytettävien arvojen nimissä.

Esimerkkiarvo:

Name: WebView2APISample.exe, Value: 0,1,2</string><string id="ReleaseChannelsDesc">Määritä WebView2-julkaisukanavat</string><string id="Network_group">Verkkoasetukset</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant">Määritä, että Access-Control-Allow-Methods vastaa CORS preflight specant conformantia</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant_Explain">Tämä käytäntö määrittää, onko pyyntömenetelmät isoilla kirjaimilla, kun ne vastaavat Access-Control-Allow-Methods vastausotsikoita CORS preflightissa.

Jos poistat tämän käytännön käytöstä, pyyntömenetelmät on kirjoitettu isolla. Tämä on toimintatapa Microsoft Edge 108 tai sitä ennen.

Jos otat tämän käytännön käyttöön tai et määritä sitä, pyyntömenetelmiä ei kirjoiteta isoilla kirjaimilla, elleivät kirjainkoolla ole merkitystä DELETE, GET, HEAD, OPTIONS, POSTtai PUTkanssa.

Tämä hylkää fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: FOO&quot; vastauksen otsikon,
ja hyväksyisi fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: Foo&quot; vastauksen otsikon.

Huomautus: tämä ei vaikuta pyyntömenetelmiin &quot;post&quot; ja &quot;put&quot;, mutta tämä vaikuttaa &quot;patch&quot;.

Tämä käytäntö on tarkoitettu väliaikaiseksi, ja se poistetaan myöhemmin.</string><string id="BlockTruncatedCookies">Estä katkaistut evästeet (vanhentunut)</string><string id="BlockTruncatedCookies_Explain">VANHENTUNUT: Tämä käytäntö on vanhentunut eikä se toimi Microsoft Edgeen siirtymisen jälkeen 131.

Tämä käytäntö antaa tilapäisen kieltäytymisen siitä, miten Microsoft Edge käsittelee JavaScriptin kautta määritettyjä evästeitä, jotka sisältävät tiettyjä ohjausmerkkejä (NULL, rivinvaihto ja rivinvaihto).
Aiemmin jokin näistä merkeistä evästemerkkijonossa katkaisi sen, mutta se määritettiin silti.
Jos nämä merkit ovat käytettävissä, koko evästemerkkijono ohitetaan.

Jos otat tämän käytännön käyttöön tai et määritä sitä, uusi toiminta otetaan käyttöön.

Jos poistat tämän käytännön käytöstä, vanha toiminta otetaan käyttöön.

Tämä käytäntö on vanhentunut, koska tämä käytäntö toteutettiin alun perin turvatoimena keskeytystapauksissa, mutta mitään niistä ei ole ilmoitettu.</string><string id="ZstdContentEncodingEnabled">Ota sisällön zstd koodauksen tuki käyttöön (vanhentunut)</string><string id="ZstdContentEncodingEnabled_Explain">VANHENTUNUT: Tämä käytäntö on vanhentunut eikä se toimi Microsoft Edgeen siirtymisen jälkeen 137.

Tämä käytäntö määrittää, tukeeko Microsoft Edge Zstandard (zstd) -sisällön koodausta.

Käytössä – Edge ilmoittaa zstd-kohteen Accept-Encoding-pyyntöotsikossa ja voi purkaa zstd-koodauksella koodattuja vastauksia.

Ei käytössä – Edge ei ilmoita tai tue zstd-sisällön koodausta.

Ei määritetty – zstd-sisällön koodauksen tuki on oletusarvoisesti käytössä.

HUOMAUTUS:
Tämä käytäntö on vanhentunut Microsoft Edgen versiosta 138 lähtien, koska Microsoft Edge tukee aina jatkossa zstd-sisällön koodausta.</string><string id="ExperimentationAndConfigurationServiceControl">Ohjaa tietoliikennettä Experimentation and Configuration Service -palvelun kanssa</string><string id="ExperimentationAndConfigurationServiceControl_Explain">Experimentation and Configuration Service -palvelua käytetään kokeilu- ja määritystietojen käyttöönottoon asiakkaalle.

Kokeilutiedot koostuvat luettelosta, jossa on kehitysominaisuuksia, joita Microsoft ottaa käyttöön testausta ja palautetta varten.

Määritystiedot koostuvat suositelluista asetuksista, jotka Microsoft haluaa ottaa käyttöön käyttökokemuksen optimoimiseksi.

Määritystiedot voivat sisältää myös luettelon tietyille toimialueille tehtävistä toimista yhteensopivuutta varten. Selain voi esimerkiksi ohittaa käyttäjäagentin merkkijonon sivustossa, jos kyseinen sivusto ei toimi. Kunkin toiminnon on tarkoitus olla tilapäinen, kun Microsoft yrittää ratkaista ongelman sivuston omistajan kanssa.

Jos määrität tämän käytännön arvoksi FullMode, kaikki tiedot ladataan Experimentation and Configuration Service -palvelusta. Tämä sisältää sekä kokeilu- että määritystiedot.

Jos määrität tämän käytännön asetukseksi ConfigurationsOnlyMode, vain määritystiedot ladataan.

Jos määrität tämän käytännön arvoksi RestrictedMode, tietoliikenne Experimentation and Configuration Service -palvelun kanssa pysäytetään kokonaan. Microsoft ei suosittele tätä asetusta.

Jos et määritä tätä käytäntöä hallitussa laitteessa, Beta- ja Stable-kanavien toiminta on sama kuin asetuksessa ConfigurationsOnlyMode. Canary- ja Dev-kanavissa toiminta on sama kuin asetuksessa FullMode.

 Jos et määritä tätä käytäntöä muussa kuin hallitussa laitteessa, toiminta on sama kuin asetuksessa FullMode.

Käytäntöasetusten määrittäminen:

* FullMode (2) = Nouda määritykset ja testit

* ConfigurationsOnlyMode (1) = Nouda vain kokoonpanot

* RestrictedMode (0) = Poista tietoliikenne Experimentation and Configuration Service -palvelun kanssa käytöstä

Käytä edellä mainittuja tietoja, kun määrität tätä käytäntöä.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Nouda määritykset ja testit</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Nouda vain kokoonpanot</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Poista tietoliikenne Experimentation and Configuration Service -palvelun kanssa käytöstä</string><string id="ForcePermissionPolicyUnloadDefaultEnabled">Määrittää, voidaanko unload -tapahtumakäsittelijät poistaa käytöstä.</string><string id="ForcePermissionPolicyUnloadDefaultEnabled_Explain">unload-tapahtumakäsittelijät poistetaan käytöstä. Niiden käynnistyminen riippuu unload-tapahtuman Permissions-Policy-käytännöstä.
Tällä hetkellä käytäntö sallii ne oletusarvoisesti. Jatkossa siirrytään vähitellen tilanteeseen, jossa niitä ei sallita oletusarvoisesti, vaan sivustojen on otettava ne erikseen käyttöön Permissions-Policy-otsikkoa käyttämällä.
Tämän yrityskäytännön avulla asteittainen käytöstä poistaminen on mahdollista estää pakottamalla tapahtumakäsittelijät pysymään oletusarvoisesti käytössä.

Sivut saattavat olla riippuvaisia unload-tapahtumakäsittelijöistä, jotta tietoja voidaan tallentaa tai palvelimelle voidaan ilmoittaa käyttäjäistunnon päättymisestä.
Tätä ei suositella, koska kyseessä on epäluotettava keino, joka heikentää suorituskykyä estämällä BackForwardCache-palvelun käytön.
Tätä varten on olemassa suositeltuja vaihtoehtoisia toimintatapoja, mutta unload-tapahtumaa on käytetty pitkän aikaa ja jotkin sovellukset saattavat siksi edelleen luottaa siihen.

Jos poistat tämän käytännön käytöstä tai et määritä sitä, unload -tapahtumakäsittelijät vanhentuvat asteittain käytöstä poistamisaikataulun mukaisesti, ja sivustot, jotka eivät määritä Permissions-Policy-otsikkoa, lakkaavat käynnistämästä unload-tapahtumia.

Jos otat tämän käytännön käyttöön, unload-tapahtumakäsittelijät toimivat edelleen oletusarvon mukaisesti.</string><string id="HttpAllowlist">HTTP-sallittujen luettelo</string><string id="HttpAllowlist_Explain">Käytännön määrittäminen määrittää isäntänimien tai isäntänimimallien luettelon (esimerkiksi [*.]example.com), jota ei päivitetä HTTPS:ksi. Tämän käytännön avulla organisaatiot voivat säilyttää pääsyn palvelimiin, jotka eivät tue HTTPS:ää, poistamatta kohteita &quot;AutomaticHttpsDefault&quot; tai &quot;HttpsUpgradesEnabled&quot; käytöstä.

Annetut isäntänimet on kanonisoitava: kaikki IDN:t on muunnettava A-label-muotoon, ja kaikkien ASCII-kirjainten on oltava pieniä kirjaimia.

Peiteisännän yleismerkkejä (eli *tai [*]) ei sallita. Sen sijaan HTTPS-First Mode- ja HTTPS-päivitykset tulisi poistaa eksplisiittisesti käytöstä niiden erityiskäytäntöjen kautta.

Huomautus: tämä käytäntö ei koske HSTS-päivityksiä.

Esimerkkiarvo:

testserver.example.com
[*.]example.org</string><string id="HttpAllowlistDesc">HTTP-sallittujen luettelo</string><string id="NewBaseUrlInheritanceBehaviorAllowed">Sallii NewBaseUrlInheritanceBehavior-ominaisuuden käyttöönoton (vanhentunut)</string><string id="NewBaseUrlInheritanceBehaviorAllowed_Explain">VANHENTUNUT: Tämä käytäntö on vanhentunut eikä se toimi Microsoft Edgeen siirtymisen jälkeen 135.

NewBaseUrlInheritanceBehavior on Microsoft Edgen ominaisuus, joka saa about:blank- ja about:srcdoc -kehykset perimään URL-perusarvonsa johdonmukaisesti käynnistäjän perus-URL-osoitteen tilannevedosten avulla.

Jos poistat tämän käytännön käytöstä, se estää käyttäjiä tai Microsoft Edgen muunnelmia ottamasta NewBaseUrlInheritanceBehavior-ominaisuutta käyttöön siltä varalta, että yhteensopivuusongelmia havaitaan.

Jos otat tämän käytännön käyttöön tai et määritä sitä, se sallii NewBaseUrlInheritanceBehavior-ominaisuuden käyttöönoton.

Käytäntö on poistettu Microsoft Edge -versiosta 136 alkaen, mutta NewBaseUrlInheritanceBehaviorAllowed-ominaisuus poistettiin Microsoft Edge -versiosta 123.</string><string id="NewPDFReaderWebView2List">Ota käyttöön sisäinen PDF-lukuohjelma, jonka tarjoaa Adobe Acrobat WebView2:lle</string><string id="NewPDFReaderWebView2List_Explain">Tämä käytäntö määrittää WebView2-sovellukset käynnistämään PDF-lukuohjelman uuden version, jonka tarjoaa Adobe Acrobatin PDF-lukuohjelma. Uusi PDF-lukuohjelma varmistaa, että toimintoja ei menetetä, ja tarjoaa paremman PDF-käyttökokemuksen. Tämä käyttökokemus sisältää monipuolisemman hahmontamisen, parannetun suorituskyvyn, vahvan suojauksen PDF-tiedostojen käsittelyyn ja entistä paremman helppokäyttöisyyden.

Jos tämä käytäntö on määritetty sovellukselle, se saattaa vaikuttaa myös muihin liittyviin sovelluksiin. Käytäntöä sovelletaan kaikkiin WebView2-painikkeisiin, jotka jakavat saman WebView2-käyttäjätietokansion. Nämä WebView2-kohteet voivat mahdollisesti kuulua useisiin sovelluksiin, jos kyseiset sovellukset, jotka ovat todennäköisesti samasta tuoteperheestä, on suunniteltu jakamaan sama käyttäjän tietokansio.

Ota uusi PDF-lukuohjelma käyttöön sovellukselle nimi-arvoparin avulla. Määritä nimeksi sovelluksen käyttäjämallin tunnus tai suoritettavan tiedoston nimi. Voit käyttää *-yleismerkkiä arvon nimenä kaikissa sovelluksissa. Määritä arvoksi true, jos haluat ottaa käyttöön uuden lukuohjelman, tai määritä sen arvoksi false, jos haluat käyttää aiemmin luotua lukulaitetta.

Jos otat tämän käytännön käyttöön määritetyille WebView2-sovelluksille, ne avaavat kaikki PDF-tiedostot uudella Adobe Acrobatin PDF-lukuohjelmalla.

Jos poistat käytännön käytöstä määritetyille WebView2-sovelluksille tai et määritä sitä, ne käyttävät nykyistä PDF-lukuohjelmaa kaikkien PDF-tiedostojen avaamiseen.

Esimerkkiarvo:

{&quot;name&quot;: &quot;app1.exe&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;app_id_for_app2&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;*&quot;, &quot;value&quot;: false}</string><string id="NewPDFReaderWebView2ListDesc">Ota käyttöön sisäinen PDF-lukuohjelma, jonka tarjoaa Adobe Acrobat WebView2:lle</string><string id="RSAKeyUsageForLocalAnchorsEnabled">Tarkista paikallisten luottamusankkureiden myöntämien palvelinvarmenteiden RSA-avaimen käyttö (vanhentunut)</string><string id="RSAKeyUsageForLocalAnchorsEnabled_Explain">VANHENTUNUT: Tämä käytäntö on vanhentunut eikä se toimi Microsoft Edgeen siirtymisen jälkeen 135.

X.509-avaimen käyttölaajennus määrittää, miten varmenteen avainta voi
käyttää. Nämä ohjeet varmistavat, että varmenteita ei käytetä tarkoituksettomassa
kontekstissa, mikä suojaa protokollarajat ylittäviltä hyökkäyksiltä HTTPS:ssä ja
muissa protokollissa. HTTPS-asiakkaiden on varmistettava, että palvelinvarmenteet vastaavat
yhteyden TLS-parametrejä.

Microsoft Edge 124 -versiosta alkaen
tämä tarkistus on aina käytössä.

Microsoft Edge 123 ja sitä vanhemmat versiot
toimivat seuraavasti:

Jos tämä käytäntö on käytössä,
Microsoft Edge suorittaa tämän avaimen
tarkistuksen. Tämä auttaa estämään hyökkäykset, joissa hyökkääjä manipuloi selainta
tulkitsemaan avainta tavoilla, joita varmenteen omistaja ei tarkoittanut.

Jos tämä käytäntö ei ole käytössä,
Microsoft Edge ohittaa tämän avaimen tarkistuksen
HTTPS-yhteyksissä, jotka neuvottelevat TLS 1.2:n kautta ja käyttävät RSA-varmennetta, joka
yhdistää paikalliseen luottamusankkuriin. Esimerkkejä paikallisista luottamusankkureista ovat
käytännön antamat tai käyttäjän asentamat päävarmenteet. Kaikissa muissa tapauksissa
tarkistus suoritetaan riippumatta tämän käytännön asetuksesta.

Jos tätä käytäntöä ei määritetä,
Microsoft Edge toimii siten kuin
käytäntö olisi käytössä.

Tämä käytäntö on järjestelmänvalvojien käytettävissä, jotta he voivat esikatsella
tulevan julkaisuversion toimintaa. Tämä tarkistus otetaan käyttöön julkaisuversiossa oletusarvoisesti. Siinä vaiheessa tämä
käytäntö pysyy tilapäisesti sellaisten järjestelmänvalvojien käytettävissä, jotka tarvitsevat lisää
aikaa päivittääkseen varmenteensa vastaamaan uusia RSA-avaimen käyttövaatimuksia.

Yhteydet, jotka eivät läpäise tätä tarkistusta, epäonnistuvat virhekoodilla
ERR_SSL_KEY_USAGE_INCOMPATIBLE. Sivustoissa, jotka epäonnistuvat tämän virheen vuoksi, on todennäköisesti
virheellisesti määritetty varmenne. Modernit ECDHE_RSA-salausohjelmistot käyttävät
digitalSignature-avaimen käyttövaihtoehtoa, kun taas vanhat RSA-salausohjelmistot
käyttävät keyEncipherment-avaimen käyttövaihtoehtoa. Jos olet epävarma, järjestelmänvalvojien pitäisi
sisällyttää molemmat RSA-varmenteisiin, jotka on tarkoitettu HTTPS:lle.

Käytäntö on poistettu Microsoft Edge -versiosta 136 alkaen,
mutta avainten tarkistus on aina otettu käyttöön Microsoft Edge versiosta 124 lähtien.</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge -versio 97, Windows 7 tai uudempi versio</string><string id="SUPPORTED_WIN7_V116">Microsoft Edge -versio 116, Windows 7 tai uudempi versio</string><string id="SUPPORTED_WIN7_V118">Microsoft Edge -versio 118, Windows 7 tai uudempi versio</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge -versio 87, Windows 7 tai uudempi versio</string><string id="SUPPORTED_WIN7_V121">Microsoft Edge -versio 121, Windows 7 tai uudempi versio</string><string id="SUPPORTED_WIN7_V123">Microsoft Edge -versio 123, Windows 7 tai uudempi versio</string><string id="SUPPORTED_WIN7_V125">Microsoft Edge -versio 125, Windows 7 tai uudempi versio</string><string id="OBSOLETE_WIN7_V123_V135">Microsoft Edge -versio 123-135, Windows 7 tai sitä uudempi</string><string id="OBSOLETE_WIN7_V125_V137">Microsoft Edge -versio 125-137, Windows 7 tai sitä uudempi</string><string id="OBSOLETE_WIN7_V123_V131">Microsoft Edge -versio 123-131, Windows 7 tai sitä uudempi</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Oletusasetukset (käyttäjien ohitettavissa)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Aseta arvon nimi sovelluksen käyttäjämallitunnukseen tai suoritettavan tiedoston nimeen. Voit käyttää &quot;*&quot;-yleismerkkiä arvon nimenä, jotta se koskee kaikkia sovelluksia.</listBox></presentation><presentation id="ChannelSearchKind"><listBox refId="ChannelSearchKindDesc">Aseta arvon nimi sovelluksen käyttäjämallitunnukseen tai suoritettavan tiedoston nimeen. Voit käyttää &quot;*&quot;-yleismerkkiä arvon nimenä, jotta se koskee kaikkia sovelluksia.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Aseta arvon nimi sovelluksen käyttäjämallitunnukseen tai suoritettavan tiedoston nimeen. Voit käyttää &quot;*&quot;-yleismerkkiä arvon nimenä, jotta se koskee kaikkia sovelluksia.</listBox></presentation><presentation id="ReleaseChannels"><listBox refId="ReleaseChannelsDesc">Aseta arvon nimi sovelluksen käyttäjämallitunnukseen tai suoritettavan tiedoston nimeen. Voit käyttää &quot;*&quot;-yleismerkkiä arvon nimenä, jotta se koskee kaikkia sovelluksia.</listBox></presentation><presentation id="AccessControlAllowMethodsInCORSPreflightSpecConformant"/><presentation id="BlockTruncatedCookies"/><presentation id="ZstdContentEncodingEnabled"/><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Ohjaa tietoliikennettä Experimentation and Configuration Service -palvelun kanssa</dropdownList></presentation><presentation id="ForcePermissionPolicyUnloadDefaultEnabled"/><presentation id="HttpAllowlist"><listBox refId="HttpAllowlistDesc">HTTP-sallittujen luettelo</listBox></presentation><presentation id="NewBaseUrlInheritanceBehaviorAllowed"/><presentation id="NewPDFReaderWebView2List"><listBox refId="NewPDFReaderWebView2ListDesc">Aseta arvon nimi sovelluksen käyttäjämallitunnukseen tai suoritettavan tiedoston nimeen. Voit käyttää &quot;*&quot;-yleismerkkiä arvon nimenä, jotta se koskee kaikkia sovelluksia.</listBox></presentation><presentation id="RSAKeyUsageForLocalAnchorsEnabled"/></presentationTable></resources></policyDefinitionResources>